{
    "@class": "GameModel",
    "name": "Project Management Game",
    "cssUri": "wegas-projectmanagementgame/css/wegas-projectmanagementgame.css",
    "widgetsUri": "wegas-projectmanagementgame/db/wegas-pmg-pages.json",
    "games":[{
        "@class":"Game",
        "name":"emba25",
        "teams":[{
            "@class": "Team",
            "name":"Les rouges",
            "players": [ {
                "@class": "Player",
                "name": "Francois",
                "user": {
                    "@class": "User",
                    "name": "Francois"
                }
            },{
                "@class": "Player",
                "name": "Dominique",
                "user": {
                    "@class": "User",
                    "name": "Dominique"
                }
            }]
        },{
            "@class": "Team",
            "name":"Les bleus",
            "players": [ {
                "@class": "Player",
                "name": "Roger",
                "user": {
                    "@class": "User",
                    "name": "Roger"
                }
            },{
                "@class": "Player",
                "name": "Marc",
                "user": {
                    "@class": "User",
                    "name": "Marc"
                }
            }]
        }]
    }],
    "variableDescriptors": [
    {
        "@class": "NumberDescriptor",
        "name": "managementApproval",
        "defaultInstance": {
            "@class": "NumberInstance",
            "value":"100"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    }, {
        "@class": "NumberDescriptor",
        "name": "userApproval",
        "defaultInstance": {
            "@class": "NumberInstance",
            "value":"100"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    }, {
        "@class": "NumberDescriptor",
        "name": "fixedCosts",
        "defaultInstance": {
            "@class": "NumberInstance",
            "value":"0"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    }, {
        "@class": "NumberDescriptor",
        "name": "quality",
        "defaultInstance": {
            "@class": "NumberInstance",
            "value":"100"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    }, {
        "@class": "NumberDescriptor",
        "name": "delay",
        "defaultInstance": {
            "@class": "NumberInstance",
            "value":"100"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },
    {
        "@class": "NumberDescriptor",
        "name": "timeCards",
        "defaultInstance": {
            "@class": "NumberInstance",
            "value":"15"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },
    {
        "@class": "StringDescriptor",
        "name": "Money",
        "defaultInstance": {
            "@class": "StringInstance",
            "value":"1"
        },
        "scope": {
            "@class": "TeamScope"
        }
    },{
        "@class": "StringDescriptor",
        "name": "Price",
        "defaultInstance": {
            "@class": "StringInstance",
            "value":"1"
        },
        "scope": {
            "@class": "GameModelScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A102B - Evaluation des besoins des monteurs",
        "label": "Fitters needs evaluation",
        "description": "Do you wish to carry out a survey with the fitters in order to talk about their needs as far as the project is concerned?",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) meet",
            "description":"You meet up with the fitters in order to talk about their expectations. You will receive an information list regarding their needs.<br />Time Budget: 3<br />Costs: 5000.- (project's fixed costs)",
            "answer":"Generally speaking the fitters find that the suggested system seems to fulfill their needs. <br /><br />The fitters would however be interested in having a system allowing for information related to a fitting problem for a particular machine model to be centralized. This would make provision for the sharing of knowledge between fitters the world over. <br /><br />Execution of this functionality is of the essence and you accept (this will slightly increase time needed to produce the software). <br /><br />User's support increases.",
            "impact":"fixedCosts.value+=5000;\ntimeCards.value-=3;\nuserApproval.value+=6;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) brief meeting",
            "description":"You meet up briefly with the fitters in order to talk about their expectations. You will get a list of details about their needs. <br />Time Budget: 1<br />Cost: 3000.- (project's fixed costs)",
            "answer":"The fitters would be interested in having a system that enables centralizing information pertaining to a fitting problem in a particular machine model. <br /><br />Execution of this functionality is compulsory and you accept it. <br /><br />User's support increases .",
            "impact":"fixedCosts.value+=3000;\ntimeCards.value-=1;\nuserApproval.value+=3;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"c) refuse",
            "description":"You do not make contact with fitters.",
            "answer":"OK",
            "impact":"userApproval.value+=8;\nquality.value-=2;"
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A103 - Présentation prototype utilisateurs",
        "label": "User Prototype Presentation",
        "description": "An engineer suggests the following:<br /><br />\"While executing the project we could use a mini system prototype and present it to future users. <br />The prototype would be executed in parallel with the creation of the specification document. This would help obtaining comments from future user about what system ought to be developed.<br />Executing the prototype would require approximately 2 weeks work for 2 people.<br />What do you think about it?\"",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) accept",
            "description":"You accept this suggestion and will hence have to deal with the \"user prototype\" extra activity during planning and implementing.<br />Time budget 1",
            "answer":"The \"user prototype\" task has been added to the project. User's support of the project is significantly improved",
            "impact":"timeCards.value-=1;\nuserApproval.value+=5;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) refuse",
            "description":"You reply you would rather not make a prototype.",
            "answer":"OK.<br />The project will therefore be implemented without presenting any prototype to the users. Future users find out and are somewhat disappointed.",
            "impact":"userApproval.value-=6;\nquality.value-=2"
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A110B - Evaluation des besoins des clients",
        "label": "Assessing customer's needs",
        "description": "A commercial manager informs you that it could be possible to perform an assessment of the customer's needs and their relative interest in a remote support and training system integrated into the machines.",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) perform the assessment",
            "description":"You answer that you are interested and wish to perform the assessment.<br />Time budget: 3<br />Cost: 4500.- (project's fixed costs)",
            "answer":"Customers seem very interested in this system. 70% declare they are ready to pay an extra charge in order to have one.<br /><br />Clients express a particular need in remote support functionalities for small repairs. The chance for clients, one of whose machine has broken down, to contact Artos repairmen via \"video-conference\" and to have the repairmen control the machine at a distance would prove very interesting. This could diminish the time during which the machines are out of order.<br /><br />The relevance for training modules is weak, even nil.<br /><br />On the other hand, it emerges from the discussions that the possibility to make notes on the plans and to document the breakdowns should be added. During a breakdown, the user of the machine could thus leave information on how she/he solved the issue. The next user could then take advantage of her/his experience. This is of particular relevance for clients using machines round the clock, with 3 teams. Indeed, the teams don't always know each other and therefore don't always share the information.",
            "impact":"fixedCosts.value+=4500;\ntimeCards.value-=3;\nuserApproval.value+=5;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) basic assessment",
            "description":"You reply that you're interested and wish to perform an assessment. But you ask that a brief rather than a complete assessment be made. <br />Time Budget : 1<br />Costs: 2000.- (project's fixed costs)",
            "answer":"Customers seem very interested in this system. <br /><br />On the other hand it emerges from the discussions that the possibility to annotate the plans and to document the breakdowns should be added.",
            "impact":"fixedCosts.value+=2000;\ntimeCards.value-=1;userApproval.value+=2;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"c) refuse",
            "description":"Your answer is that for this project no assessment of the customer's needs shall be carried out.",
            "answer":"ok.",
            "impact":"managementApproval.value-=10;\nuserApproval.value-=8;"
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A112 - Analyses de faisabilité",
        "label": "Feasibility analyses",
        "description": "Mr Dupuis, head of R&D, asks you the following question : <br />\"Should you carry out feasibility analyses during the pre project phase, in what order would you do this?\"",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) Market – Technical – Financial",
            "description":"You answer that you would carry out the market feasibility analysis followed by the technical feasibility analysis and finish with the financial feasibility analysis.",
            "answer":"Mr Dupuis is happy with your reply and, perceiving your project management skills, his support towards you increases.",
            "impact":"managementApproval.value+=4;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b)  Technical – Financial – Market",
            "description":"You answer that you would carry out the technical feasibility analysis followed by the financial feasibility analysis and finish with the market analysis.",
            "answer":"Mr Dupuis is quite concerned about the way in which you expect to carry out the financial analysis while not knowing about the potential market. This seems rather difficult to say the least...<br />On the other hand, he is wondering why you would carry out the technical feasibility analysis, usually the most expensive one, before the market analysis which, at a much lower cost, allows verifying whether or not the project meets any need. <br />His support towards you diminishes.",
            "impact":"managementApproval.value-=6;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"c) Financial - Technical – Market",
            "description":"You answer that you would carry out the financial feasibility analysis followed by the technical feasibility analysis and finish with the market analysis.",
            "answer":"Mr Dupuis is quite concerned about the way in which you expect to carry out the financial feasibility analysis if you do not know about the potential market. This appears to be rather difficult...<br />On the other hand, he would like to know why you would carry out the technical feasibility analysis, usually the most expensive one, before the market analysis which, at a much lower cost, allows verifying whether or not the project meets any need. <br />His support towards you diminishes.",
            "impact":"managementApproval.value-=4;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"d) don't know",
            "description":"You answer that you don't know",
            "answer":"It's better than answering just anything, but you haven't really convinced as regards your skills in terms of project management.<br />Mr Dupuis' support towards you diminishes..",
            "impact":"managementApproval.value-=3;"
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A113B - Assurance taux de change",
        "label": "Exchange rate insurance",
        "description": "If the project is accepted, some material components shall be ordered abroad.<br /><br />In order to provide against exchange risks, your banker suggests you conclude an \"exchange rate\" insurance that would protect you against unfavorable exchange rates during the time of the project.",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) accept",
            "description":"You accept your bankers' suggestion.<br />Time budget: 1<br />Costs: 500.- (project's fixed costs)",
            "answer":"In case of an unfavorable exchange rate modification during the project, contact the banker. He shall intervene in order to solve the issue.",
            "impact":"fixedCosts.value+=500;\ntimeCards.value-=1;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) refuse",
            "description":"You refuse to take out the \"exchange rate\" insurance.",
            "answer":"Exchange rate fluctuation during the project may partially change the budget for material purchases made abroad.",
            "impact":""
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A151 - Faisabilité de marché",
        "label": "Market feasibility",
        "description": "Marketing service suggests refining the basic assessment provided by the marketing manager in the \"state of situation\" document and to analyze the commercial interest of executing the e-assistance system",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) execute the study",
            "description":"You accept the suggestion. You obtain further and more accurate information concerning the potential of interested customers and the price they would be ready to pay for this system. <br />Time Budget : 3<br />Costs: 4000.- (project's fixed costs)",
            "answer":"You have carried out a survey with a sample of representative customers.<br />It seems that this option would increase sales. On the other hand, a supplement estimated at 3'500.- would be reasonable for this option.<br /><br />At this price, roughly 250 machines would be sold with this new option in the next 7 years, spread in proportion over the seven years.",
            "impact":"fixedCosts.value+=4000;\ntimeCards.value-=3;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) produce a brief study",
            "description":"You accept this proposal, but suggest a brief study be carried out. You shall obtain general information concerning interested customers' potential, as well as the selling price for this option. <br />Time Budget : 2<br />Costs: 2000.- (project's fixed costs)",
            "answer":"You've carried out a brief survey with a sample of representative customers. This survey shows that the client's interest is stronger than the marketing manager had expected.<br /><br />It seems that this option would not allow sales to increase. On the other hand, a supplement estimated from 2'000.- to 3'500.- would be reasonable for this option.<br /><br />For this price, 150 to 300 machines would be sold with this new option in the next 7 years, spread in proportion over the 7 years <br /><br />A more accurate survey should be carried out to obtain more accurate figures",
            "impact":"fixedCosts.value+=2000;\ntimeCards.value-=2;\ntimeCards-=2;this[\"A151 - Faisabilité de marché -  complément d'étude\"].active = true;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"c) do not carry out the survey",
            "description":"You answer that you'll stick to the basic assessment provided by the marketing manager.",
            "answer":"Let's hope the source data are correct...",
            "impact":""
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A151 - Faisabilité de marché -  complément d'étude",
        "label": "Market feasibility – complement",
        "description": "You've carried out a brief market study. Marketing service suggests you carry out a complement to this study in order to obtain full information.",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) produce the study complement",
            "description":"You accept the proposal. <br />You'll obtain supplementary and more accurate information concerning the potential of interested customers and the price they are willing to pay for this system. <br />Time Budget : 2<br />Costs: 2500.- (project's fixed costs)",
            "answer":"The study complement (new survey with the customers) has allowed to obtain the following information.<br />The supplement amount for this option is estimated at 3'500.-.<br />The amount of machines sold with this new option would be around 250 for the next seven years, spread in proportion over the 7 years.",
            "impact":"fixedCosts.value+=2500;\ntimeCards.value-=2;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) do not produce a complement",
            "description":"You answer that you are satisfied with the brief study results",
            "answer":"OK",
            "impact":""
        }],
        "defaultInstance": {
            "@class": "MCQInstance",
            "active": false
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A152B - Faisabilité technique",
        "label": "Technical feasibility",
        "description": "An engineer from the R&D department suggests you produce a technical feasibility study.",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a)produce the study",
            "description":"You accept the suggestion.<br />A developer engineer shall produce a pre-study. He shall be able to provide you with information pertaining to the system's technical feasibility.<br />Time Budget : 2<br />Cost: 3000.- (project's fixed costs)",
            "answer":"The technical feasibility study result shows that E-assistance development is technically possible. The system can be compatible with the entire range of Artos machines. The analysis has however shown that a type of milling machine cannot currently handle this system. It will be necessary to integrate this restriction during development. This would have at any rate been detected during implanting on the machines, but corrections would have then proved more difficult.<br />The analysis also shows that the development costs should be estimated 20% higher than the initial estimation of the project.",
            "impact":"fixedCosts.value+=3000;\ntimeCards.value-=2;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) do not produce the study",
            "description":"You prefer not to produce the study.",
            "answer":"So you shall produce the project risking a possible technical incompatibility that shall only be visible during or after having finished developing.",
            "impact":""
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A153 - Types de réparation",
        "label": "Repair types",
        "description": "You may investigate with the repairers in order to obtain more information on repair types and conditions carried out on machines at the customer's places.",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) carry out investigation",
            "description":"You carry out the investigation with all the repairers. You shall thus obtain information pertaining to the different repairs and, some repairers having previously worked with the competitors, on Artos' position in relation to the other manufacturers <br />Time Budget : 4",
            "answer":"The amount of breakdowns at Artos is akin to that at other competitors, but intervention is more time consuming.<br />According to the repairers, many interventions (30 at least per year) require 2 days travel for a repair lasting a few minutes. Many such \"small\" interventions could be carried out by the customers if they were presented with an efficient assistance system.<br />If E-assistance enables video conference contact and taking control of the user's workplace, it seems certain that many breakdowns will be repaired faster and travel avoided. <br />Repairers are very happy you dedicated time to them and that their knowledge was taken into account.",
            "impact":"timeCards.value-=5;\nuserApproval.value+=5;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) carry out a brief study",
            "description":"You carry out a brief study with a few repairers having beforehand worked with a competitor. You shall thus obtain some information regarding Artos' position in relation to the other manufacturers. <br />Time Budget : 2",
            "answer":"The amount of breakdowns at Artos is akin to that at other the competitors, but intervention is more time consuming. <br />It seems that many breakdowns could be repaired faster and travel avoided. <br />The repairers have appreciated your taking their knowledge into account. They would however have appreciated your dedicating more time to them.",
            "impact":"timeCards.value-=2;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"c) do not carry out the survey",
            "description":"You would rather not carry out the survey.",
            "answer":"On going to the cafeteria, you meet briefly with two repairers.<br />The first one shouts out : <br />\"It's surprising you haven't come to see us and asked us about the things we know. We have field information you do not have access to from your study offices!\"<br />To which the second adds: <br />\"Do you at least know what it is we need? I hope you'll develop a system able to respond to our needs and expectations.\"",
            "impact":"userApproval.value-=3;"
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    },{
        "@class": "MCQDescriptor",
        "name": "A154 - Un après-midi à choix",
        "label": "A free afternoon",
        "description": "You have a free afternoon in your planning.<br /><br />How do expect to use this available time?",
        "replies": [
        {
            "@class": "MCQReplyDescriptor",
            "name":"a) meet user-interface resources",
            "description":"You meet up with the people responsible for executing the user-interface program to obtain information concerning this task's creation. <br />Time Budget: 1",
            "answer":"Here is some information obtained during the discussion with resources intended for the \"user-interface programming\": <br />It is of the essence to assign the number of people requested. Halving the resources more than doubles the time it takes to produce the task. These people are indeed used to working together and share out the work between themselves according to their skills.",
            "impact":"timeCards.value-=1;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"b) management : information on deadlines",
            "description":"You try to get management to provide you with information concerning possible deadlines to execute the e-assistance project.<br />Time Budget: 1",
            "answer":"Surprised at this question, management answers: \"It is hard to define a deadline without really knowing about the goal and incidentally the costs and benefits of your project. It seems this should be carried out in less than 3 months. After all, is it not up to you to define a deadline in your project suggestion?\"<br />Management suggests you shape things into a project suggestion you will then present to the project selection committee.",
            "impact":"timeCards.value-=1;\nmanagementApproval.value-=5;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"c) management : information on strategy",
            "description":"You try to get a member of management to provide you with information about Artos' strategy in relation to the project.<br />Time Budget : 1",
            "answer":"You've managed to get the following information: <br />Generally speaking, Artos wishes to develop proximity with the customer and accurately respond to their needs. Amongst other things, it would be good to diminish as much as possible the time during which the machines are stopped.<br />From an internal perspective, reducing the fitter's travel costs is one point that ought to be improved in the next few years. <br />Management has appreciated your inquiring after strategy.",
            "impact":"timeCards.value-=1;\nmanagementApproval.value+=2;"
        },
        {
            "@class": "MCQReplyDescriptor",
            "name":"d) taking leave",
            "description":"You have some rest.",
            "answer":"from time to time it's pleasant ;-)",
            "impact":""
        }],
        "defaultInstance": {
            "@class": "MCQInstance"
        },
        "scope": {
            "@class": "PlayerScope"
        }
    }]
}